zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/periph/PERI_LPI2C.h
/*
** ###################################################################
**     Processors:          MC56F80623VLC
**                          MC56F80626VLF
**                          MC56F80643VLC
**                          MC56F80646VLF
**                          MC56F80648VLH
**                          MC56F80723VLC
**                          MC56F80726VLF
**                          MC56F80733VFM
**                          MC56F80736VLF
**                          MC56F80738VLH
**                          MC56F80743VFM
**                          MC56F80743VLC
**                          MC56F80746MLF
**                          MC56F80746VLF
**                          MC56F80748MLH
**                          MC56F80748VLH
**
**     Version:             rev. 1.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         CMSIS Peripheral Access Layer for LPI2C
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2022-01-12)
**         Initial version.
**     - rev. 1.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_LPI2C.h
 * @version 1.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for LPI2C
 *
 * CMSIS Peripheral Access Layer for LPI2C
 */

#if !defined(PERI_LPI2C_H_)
#define PERI_LPI2C_H_                            /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MC56F80623VLC))
#include "MC56F80623_COMMON.h"
#elif (defined(CPU_MC56F80626VLF))
#include "MC56F80626_COMMON.h"
#elif (defined(CPU_MC56F80643VLC))
#include "MC56F80643_COMMON.h"
#elif (defined(CPU_MC56F80646VLF))
#include "MC56F80646_COMMON.h"
#elif (defined(CPU_MC56F80648VLH))
#include "MC56F80648_COMMON.h"
#elif (defined(CPU_MC56F80723VLC))
#include "MC56F80723_COMMON.h"
#elif (defined(CPU_MC56F80726VLF))
#include "MC56F80726_COMMON.h"
#elif (defined(CPU_MC56F80733VFM))
#include "MC56F80733_COMMON.h"
#elif (defined(CPU_MC56F80736VLF))
#include "MC56F80736_COMMON.h"
#elif (defined(CPU_MC56F80738VLH))
#include "MC56F80738_COMMON.h"
#elif (defined(CPU_MC56F80743VFM) || defined(CPU_MC56F80743VLC))
#include "MC56F80743_COMMON.h"
#elif (defined(CPU_MC56F80746MLF) || defined(CPU_MC56F80746VLF))
#include "MC56F80746_COMMON.h"
#elif (defined(CPU_MC56F80748MLH) || defined(CPU_MC56F80748VLH))
#include "MC56F80748_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- LPI2C Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPI2C_Peripheral_Access_Layer LPI2C Peripheral Access Layer
 * @{
 */

/** LPI2C - Register Layout Typedef */
typedef struct {
  __IO uint16_t MCR;                               /**< Master Control Register, offset: 0x0 */
  __IO uint16_t MSR;                               /**< Master Status Register, offset: 0x1 */
  __IO uint16_t MIER;                              /**< Master Interrupt Enable Register, offset: 0x2 */
  __IO uint16_t MDER;                              /**< Master DMA Enable Register, offset: 0x3 */
  __IO uint16_t MCFGR0;                            /**< Master Configuration Register 0, offset: 0x4 */
  __IO uint16_t MCFGR1;                            /**< Master Configuration Register 1, offset: 0x5 */
  __IO uint16_t MCFGR2;                            /**< Master Configuration Register 2, offset: 0x6 */
  __IO uint16_t MCFGR3;                            /**< Master Configuration Register 3, offset: 0x7 */
  __IO uint16_t MCFGR4;                            /**< Master Configuration Register 4, offset: 0x8 */
  __IO uint16_t MDMR;                              /**< Master Data Match Register, offset: 0x9 */
  __IO uint16_t MCCR0;                             /**< Master Clock Configuration Register 0, offset: 0xA */
  __IO uint16_t MCCR1;                             /**< Master Clock Configuration Register 1, offset: 0xB */
  __IO uint16_t MCCR2;                             /**< Master Clock Configuration Register 2, offset: 0xC */
  __IO uint16_t MCCR3;                             /**< Master Clock Configuration Register 3, offset: 0xD */
  __IO uint16_t MFCR;                              /**< Master FIFO Control Register, offset: 0xE */
  __I  uint16_t MFSR;                              /**< Master FIFO Status Register, offset: 0xF */
  __O  uint16_t MTDR;                              /**< Master Transmit Data Register, offset: 0x10 */
  __I  uint16_t MRDR;                              /**< Master Receive Data Register, offset: 0x11 */
  __IO uint16_t SCR;                               /**< Slave Control Register, offset: 0x12 */
  __IO uint16_t SSR;                               /**< Slave Status Register, offset: 0x13 */
  __IO uint16_t SIER;                              /**< Slave Interrupt Enable Register, offset: 0x14 */
  __IO uint16_t SDER;                              /**< Slave DMA Enable Register, offset: 0x15 */
  __IO uint16_t SCFGR0;                            /**< Slave Configuration Register 0, offset: 0x16 */
  __IO uint16_t SCFGR1;                            /**< Slave Configuration Register 1, offset: 0x17 */
  __IO uint16_t SCFGR2;                            /**< Slave Configuration Register 2, offset: 0x18 */
  __IO uint16_t SCFGR3;                            /**< Slave Configuration Register 3, offset: 0x19 */
  __IO uint16_t SAMR0;                             /**< Slave Address Match Register 0, offset: 0x1A */
  __IO uint16_t SAMR1;                             /**< Slave Address Match Register 1, offset: 0x1B */
  __I  uint16_t SASR;                              /**< Slave Address Status Register, offset: 0x1C */
  __IO uint16_t STAR;                              /**< Slave Transmit ACK Register, offset: 0x1D */
  __O  uint16_t STDR;                              /**< Slave Transmit Data Register, offset: 0x1E */
  __I  uint16_t SRDR;                              /**< Slave Receive Data Register, offset: 0x1F */
} LPI2C_Type;

/* ----------------------------------------------------------------------------
   -- LPI2C Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPI2C_Register_Masks LPI2C Register Masks
 * @{
 */

/*! @name MCR - Master Control Register */
/*! @{ */

#define LPI2C_MCR_MEN_MASK                       (0x1U)
#define LPI2C_MCR_MEN_SHIFT                      (0U)
/*! MEN - Master Enable
 *  0b0..Master logic is disabled
 *  0b1..Master logic is enabled
 */
#define LPI2C_MCR_MEN(x)                         (((uint16_t)(((uint16_t)(x)) << LPI2C_MCR_MEN_SHIFT)) & LPI2C_MCR_MEN_MASK)

#define LPI2C_MCR_RST_MASK                       (0x2U)
#define LPI2C_MCR_RST_SHIFT                      (1U)
/*! RST - Software Reset
 *  0b0..Master logic is not reset
 *  0b1..Master logic is reset
 */
#define LPI2C_MCR_RST(x)                         (((uint16_t)(((uint16_t)(x)) << LPI2C_MCR_RST_SHIFT)) & LPI2C_MCR_RST_MASK)

#define LPI2C_MCR_DOZEN_MASK                     (0x4U)
#define LPI2C_MCR_DOZEN_SHIFT                    (2U)
/*! DOZEN - Doze mode enable
 *  0b0..Master is enabled in Doze mode
 *  0b1..Master is disabled in Doze mode
 */
#define LPI2C_MCR_DOZEN(x)                       (((uint16_t)(((uint16_t)(x)) << LPI2C_MCR_DOZEN_SHIFT)) & LPI2C_MCR_DOZEN_MASK)

#define LPI2C_MCR_DBGEN_MASK                     (0x8U)
#define LPI2C_MCR_DBGEN_SHIFT                    (3U)
/*! DBGEN - Debug Enable
 *  0b0..Master is disabled in debug mode
 *  0b1..Master is enabled in debug mode
 */
#define LPI2C_MCR_DBGEN(x)                       (((uint16_t)(((uint16_t)(x)) << LPI2C_MCR_DBGEN_SHIFT)) & LPI2C_MCR_DBGEN_MASK)

#define LPI2C_MCR_RTF_MASK                       (0x100U)
#define LPI2C_MCR_RTF_SHIFT                      (8U)
/*! RTF - Reset Transmit FIFO
 *  0b0..No effect
 *  0b1..Transmit FIFO is reset
 */
#define LPI2C_MCR_RTF(x)                         (((uint16_t)(((uint16_t)(x)) << LPI2C_MCR_RTF_SHIFT)) & LPI2C_MCR_RTF_MASK)

